In [1]:
import pandas as pd    
import numpy as np

##### 1. Considere as tabelas de vendas diárias de três lojas:

In [6]:
lista = ["A", "K", "A"]
Mercearia = pd.DataFrame({"loja":lista,
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})

Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})

Restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

 Data Frame Juntando por linha

In [7]:
pd.concat([Mercearia,Farmácia,Restaurante])

  loja  dia  valor
0    A  sex   7500
1    K  sab   9500
2    A  dom   8200
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900
0    C  sab   7500
1    C  dom  11800

Data Frame juntando por colunas

In [5]:
pd.concat([Mercearia,Farmácia,Restaurante], axis= 1)

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

No primeiro caso, concatenando por linha. temos que cada dicionario de dados é inserido ao final do outro, repetindo os indices de cada dicionario de dados.
No segundo caso, concatenando por coluna. temos que os indices são usados de acordo com o maior dicionario, caso falte algum valor de linha, automatica sera inserido o valor NaN(visivel na linha 2, a partir da coluna 7), enquanto todas as colunas são repetidas para cada dicionario de dados.

##### 2. Com base nos dataframes a seguir, que guardam informações de matriculas de alunos em dois cursos, um de SQL e outro de Python:

In [5]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})

PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

(a) quais são os alunos distintos, considerando ambas as listas?

In [6]:
pd.concat([SQL,PYTHON]).drop_duplicates()

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
0           ana@xyz.com
1  jonas@acmecorpus.com

(b) quais são os alunos que fizeram ambos os cursos?

In [7]:
PYTHON.merge(SQL)

            email
0  rakesh@xyz.com

(c) quais os alunos que realizaram o curso de SQL, mas não o de PYTHON (e
vice-versa)?

Somente SQL

In [8]:
SQL[SQL.email.isin(PYTHON.email)==False]

                email
1  ecg@acmecorpus.com

Somente Python

In [9]:
PYTHON[PYTHON.email.isin(SQL.email)==False]

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

##### 3. Considere os dois dataframes a seguir, referentes aos dados sobre os departamentos e os funcionários de uma empresa.

In [10]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]
}
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]
}

empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

In [11]:
pd.merge(empresa,funcionarios, left_on= "id", right_on= "idDepto")

   id nomDepto local   num    nome  salario idDepto
0  D2       RH    RJ  3199     Ana     1600      D2
1  D2       RH    RJ  3788  Marina     5000      D2
2  D3       TI    RJ  3269   David     2975      D3
3  D4   Vendas    SP  3844    Luís     3000      D4